tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/horcrux"
tap "jorgelbg/tap"
tap "steipete/tap"
brew "age"
brew "bash"
brew "bat"
brew "colordiff"
brew "diffutils"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "sqlite"
brew "grc"
brew "htop"
brew "jq"
brew "just"
brew "mas"
brew "tree-sitter"
brew "neovim"
brew "pinentry-mac"
brew "poetry"
brew "prettier"
brew "protobuf"
brew "python@3.12"
brew "ripgrep"
brew "ruff"
brew "shfmt"
brew "speedtest-cli"
brew "stylua"
brew "swift-protobuf"
brew "tealdeer"
brew "tig"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "typst"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "jesseduffield/horcrux/horcrux"
brew "jorgelbg/tap/pinentry-touchid"
cask "claude"
cask "claude-code@latest"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "cursor"
cask "darktable"
cask "docker-desktop"
cask "iina"
cask "obsidian"
cask "raycast"
cask "signal"
cask "stats"
cask "stremio"
cask "t3-code"
cask "visual-studio-code"
cask "whatsapp"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Auto HD FPS for YouTube", id: 1546729687
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark Desktop", id: 6445813049
mas "Telegram", id: 747648890
vscode "charliermarsh.ruff"
vscode "davidlday.languagetool-linter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "pkief.material-icon-theme"
vscode "swiftlang.swift-vscode"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
