tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "bash"
brew "python@3.11"
brew "black"
brew "ccache"
brew "cmake"
brew "cocoapods"
brew "composer"
brew "dfu-util"
brew "diffutils"
brew "direnv"
brew "eslint"
brew "fd"
brew "fnm"
brew "fzf"
brew "gcc"
brew "git"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "gtk+"
brew "htop"
brew "jq"
brew "just"
brew "libffi"
brew "libmagic"
brew "mypy"
brew "mysql"
brew "neovim"
brew "ninja"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "postgresql@15"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "ruff"
brew "rustfmt"
brew "rustup-init"
brew "shfmt"
brew "stylelint"
brew "stylua"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "teamookla/speedtest/speedtest"
cask "alfred"
cask "docker"
cask "notion"
cask "postman"
cask "rar"
cask "slack"
cask "stats"
cask "stremio"
cask "visual-studio-code"
cask "whatsapp-alpha"
cask "zoom"
vscode "charliermarsh.ruff"
vscode "ducfilan.pug-formatter"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "monosans.djlint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "PKief.material-icon-theme"
vscode "samuelcolvin.jinjahtml"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vscodevim.vim"
