tap "atlassian/acli"
tap "bufbuild/buf"
tap "jorgelbg/tap"
tap "sdkman/tap"
brew "awscli"
brew "bash"
brew "bat"
brew "cloc"
brew "cocoapods"
brew "colima", args: ["HEAD"]
brew "colordiff"
brew "cosign"
brew "diffutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "fetch"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "googleworkspace-cli"
brew "grc"
brew "grep"
brew "htop"
brew "hub"
brew "jq"
brew "just"
brew "librsvg"
brew "logcli"
brew "miller"
brew "mysql-client"
brew "neovim"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "playwright-cli"
brew "prettier"
brew "python@3.12"
brew "ripgrep"
brew "rsc_2fa"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "stylua"
brew "tealdeer"
brew "tenv"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "watch"
brew "websocat"
brew "wget"
brew "xq"
brew "zsh-completions"
brew "atlassian/acli/acli"
brew "bufbuild/buf/buf"
brew "jorgelbg/tap/pinentry-touchid"
brew "sdkman/tap/sdkman-cli"
cask "1password-cli"
cask "android-studio"
cask "beekeeper-studio"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "codexbar"
cask "cursor"
cask "cursor-cli"
cask "flutter"
cask "gcloud-cli"
cask "keybase"
cask "neo4j-desktop"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "redis-insight"
cask "stats"
cask "t3-code"
cask "ungoogled-chromium"
cask "visual-studio-code"
vscode "angular.ng-template"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "vscodevim.vim"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/boumenot/gocover-cobertura"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
